Tekla Open API Reference for Tekla Structures 2025
OBB.DistanceTo Method (LineSegment)
 Calculates the distance from OBB to given LineSegment.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double DistanceTo(
	LineSegment lineSegment
)
Public Function DistanceTo (
	lineSegment As LineSegment
) As Double
Parameters
lineSegment
Type: Tekla.Structures.Geometry3d.LineSegment
LineSegment to calculate against.
Return Value
Type: Double
Distance from OBB to given LineSegment.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is assigned to the lineSegment parameter.
See Also
Reference
OBB Class
DistanceTo Overload
Tekla.Structures.Geometry3d Namespace